In [1]:
import numpy as np
import pandas as pd
import lightgbm as lgbm

In [2]:
# load the data

import os

folder = "data"

wrw_data = pd.read_sas(os.path.join(folder, "who_rated_what_2006.sas7bdat"))
answer_data = pd.read_sas(os.path.join(folder, "who_rated_what_2006.sas7bdat"))
movie_titles_data = pd.read_sas(os.path.join(folder, "movie_titles_named.sas7bdat"))

In [3]:
wrw_data.head(5)

   User_ID  Movie_ID
0      6.0   16983.0
1     10.0   11888.0
2     10.0   14584.0
3     10.0   15957.0
4    131.0   17405.0

In [4]:
movie_titles_data.head()

   Movie_ID    Year                       Movie_Name
0       1.0  2003.0               b'Dinosaur Planet'
1       2.0  2004.0    b'Isle of Man TT 2004 Review'
2       3.0  1997.0                     b'Character'
3       4.0  1994.0  b"Paula Abdul's Get Up & Dance"
4       5.0  2004.0      b'The Rise and Fall of ECW'

In [5]:
answer_data.head()

   User_ID  Movie_ID
0      6.0   16983.0
1     10.0   11888.0
2     10.0   14584.0
3     10.0   15957.0
4    131.0   17405.0

In [12]:
%%time

'''
# load the data in chunks ~ get a generator
with pd.read_sas(os.path.join(folder, "combined_netflix_data.sas7bdat"), chunksize=1000000) as reader:
    for i,chunk in enumerate(reader):
        print(i, end=' ')
        if i % 10 == 29:
            print()
'''

# read a chunk of 5M lines
reader = pd.read_sas(os.path.join(folder, "combined_netflix_data.sas7bdat"), chunksize=5000000)

data = next(reader)

print(data.head())
print("Memory consumed by test set      :   {} MB" .format(data.memory_usage(index=True).sum()/ 1024**2))

   Movie_ID    User_ID  Rating Rating_Date
0       1.0  1488844.0     3.0  2005-09-06
1       1.0   822109.0     5.0  2005-05-13
2       1.0   885013.0     4.0  2005-10-19
3       1.0    30878.0     4.0  2005-12-26
4       1.0   823519.0     3.0  2004-05-03
Memory consumed by test set      :   152.5880126953125 MB
Wall time: 7.82 s

In [9]:
# check if any columns are none
for c in data.columns:
    print(c, "null values:", data[c].isnull().values.any())

Movie_ID null values: False
User_ID null values: False
Rating null values: False
Rating_Date null values: False

In [5]:
# test and train set

In [6]:
# build the model

In [7]:
# test the result